app/controllers/helper_types_controller.rb

  def index
    @helper_types = HelperType.all
---
SELECT "helper_types".* FROM "helper_types"

  def create
    @helper_type = HelperType.create!(helper_type_params)
---
INSERT INTO "helper_types" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Polisi"], ["created_at", "2018-08-06 01:12:03.011760"], ["updated_at", "2018-08-06 01:12:03.011760"]]

    def set_helper_type
      @helper_type = HelperType.find(params[:id])
---
SELECT  "helper_types".* FROM "helper_types" WHERE "helper_types"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]