app/controllers/helper_controller.rb

SELECT "helpers".* FROM "helpers"
---
  def index
    @helpers = Helper.all

INSERT INTO "helpers" ("name", "email", "password", "phone_number", "helper_type_id", "created_at", "updated_at", "device_id", "longitude", "latitude") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
SELECT  "helper_types".* FROM "helper_types" WHERE "helper_types"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
    @helper = Helper.create!(helper_params)
    @helper_type = HelperType.find(params[:helper_type_id])

UPDATE "helpers" SET "device_id" = $1, "updated_at" = $2 WHERE "helpers"."id" = $3
---
  def update
    @helper.update(helper_params)

UPDATE "helpers" SET "longitude" = $1, "latitude" = $2, "updated_at" = $3 WHERE "helpers"."id" = $4  [["longitude", 1.0], ["latitude", 2.0], ["updated_at", "2018-08-11 03:16:24.606029"], ["id", 3]]
---
  def update_location
    @helper.update(location_params)

DELETE FROM "helpers" WHERE "helpers"."id" = $1  [["id", 4]]
---
  def destroy
    @helper.destroy

SELECT  "helpers".* FROM "helpers" WHERE "helpers"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---
  def set_helper
    @helper = Helper.find(params[:id])