app/controllers/user_requests_controller.rb

SELECT "user_requests".* FROM "user_requests"
---
  def index
    @user_requests = UserRequest.all

INSERT INTO "user_requests" ("user_id", "longitude", "latitude", "device_id", "created_at", "updated_at", "helper_type_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT "helpers".* FROM "helpers"
---
  def create
    @user_request = UserRequest.create!(user_request_params)
    @helpers = Helper.all

    @helpers.each { |helper|

DELETE FROM "user_requests" WHERE "user_requests"."id" = $1  [["id", 20]]
---
  def destroy
    @user_request.destroy

SELECT "user_requests".* FROM "user_requests"
UPDATE "user_requests" SET "helper_id" = $1, "updated_at" = $2 WHERE "user_requests"."id" = $3  [["helper_id", 1], ["updated_at", "2018-08-16 09:54:52.523796"], ["id", 1]]
---
  def filter_request
    @user_requests = UserRequest.all
    @result = []

    @user_requests.each { |request|
      if request.helper_type_id == params[:helper_type_id]
        location_user = DistanceHelper::init_location(request.latitude, request.longitude)
        location_helper = DistanceHelper::init_location(params[:latitude].to_f, params[:longitude].to_f)
        distance_between = DistanceHelper::get_distance(location_user, location_helper)

        if DistanceHelper::is_helper_close_to_user(distance_between)
          @result.push(request)

SELECT  "user_requests".* FROM "user_requests" WHERE "user_requests"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
---
  def set_user_request
    @user_request = UserRequest.find(params[:id])