app/controllers/user_requests_controller.rb

  def accept_request
    @user_request = UserRequest.find(params[:user_request_id])
    if not @user_request.helper_id
      @user_request.update(accept_request_params)
---
SELECT  "user_requests".* FROM "user_requests" WHERE "user_requests"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "user_requests" SET "helper_id" = $1, "updated_at" = $2 WHERE "user_requests"."id" = $3  [["helper_id", 1], ["updated_at", "2018-08-16 09:54:52.523796"], ["id", 1]]